package section07;
/*
 * OOP (Object Oriented Programming)
 * 	- 객체 지향 프로그래밍
 * 	- 프로그램을 작성할 때 데이터와 데이터를 조작하는 메소드를 하나의 논리적 단위인 객체로 묶는 방식
 * 
 * 객체(Object)
 * 	- 물리적으로 존재하거나 추상적으로 생각할 수 있는 것
 * 	- 정의 가능하고 식별 가능하다
 * 	- 속성(변수)과 기능(메소드)으로 구성되어있다.
 * 
 * 	예) 물리적인 객체 - 회원, 컴퓨터, 자동차, 상품 등
 *	   추상적인 객체 - 주문정보, 생산정보, 회계장부 등
 *
 *	객체 구성요소
 *	1) 속성
 *	2) 기능
 *
 *	예) 티모 객체
 *	속성	1) 공격력 - 10
 *		2) 방어력 - 3
 *		3) 체력(HP) - 800
 *		4) 이동속도 - 5
 *
 *	기능 	1) 실명 - 상대 시야 가리고 독데미지 + 상대스킬 침묵
 *		2) 신속 - 이동속도 올라가는 스킬 {이동속도 *1.2;}
 *		
 */
public class OOP01 {

}
